backend/perf/results/hold-lua-snapshot-valid-100-1-k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: perf/booking-preauthenticated.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 5m30s max duration (incl. graceful stop):
              * booking_preauthenticated: 1 iterations for each of 100 VUs (maxDuration: 5m0s, gracefulStop: 30s)

time="2026-08-16T16:46:06+07:00" level=warning msg="Request Failed" error="Post \"http://127.0.0.1:3003/api/v1/shows/6a8186bf595d89c19134f826/waiting-room/join\": dial tcp 127.0.0.1:3003: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-16T16:46:06+07:00" level=warning msg="Request Failed" error="Post \"http://127.0.0.1:3003/api/v1/shows/6a8186bf595d89c19134f826/waiting-room/join\": dial tcp 127.0.0.1:3003: connectex: No connection could be made because the target machine actively refused it."
time="2026-08-16T16:46:06+07:00" level=warning msg="Request Failed" error="Post \"http://127.0.0.1:3003/api/v1/shows/6a8186bf595d89c19134f826/waiting-room/join\": dial tcp 127.0.0.1:3003: connectex: No connection could be made because the target machine actively refused it."
[...]


  █ TOTAL RESULTS 

    CUSTOM
    unexpected_failures...: 100.00% 100 out of 100

    HTTP
    http_req_duration.....: min=0s    avg=0s    med=0s     p(90)=0s    p(95)=0s      p(99)=0s      max=0s     
    http_req_failed.......: 100.00% 100 out of 100
    http_reqs.............: 100     8601.114704/s

    EXECUTION
    iteration_duration....: min=546µs avg=4.8ms med=3.93ms p(90)=9.4ms p(95)=10.55ms p(99)=11.09ms max=11.09ms
    iterations............: 100     8601.114704/s

    NETWORK
    data_received.........: 0 B     0 B/s
    data_sent.............: 0 B     0 B/s



running (0m00.0s), 000/100 VUs, 100 complete and 0 interrupted iterations
booking_preauthenticated ✓ [ 100% ] 100 VUs  0m00.0s/5m0s  100/100 iters, 1 per VU